docs: README rework
